/*
The MIT License (MIT)

Copyright (c) 2024 sigma-axis

Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the “Software”), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/

#include <cstdint>
#include <algorithm>
#include <cmath>
#include <cstring>
#include <string>
#include <vector>
#include <map>
#include <memory>
#include <bit>
#include <concepts>

#define NOMINMAX
#define WIN32_LEAN_AND_MEAN
#include <Windows.h>
#include <CommCtrl.h>
#pragma comment(lib, "comctl32")

using byte = uint8_t;
#include <exedit.hpp>

using namespace AviUtl;
using namespace ExEdit;

#include "modkeys.hpp"
#include "slim_formatter.hpp"
#include "memory_protect.hpp"


////////////////////////////////
// 主要情報源の変数アドレス．
////////////////////////////////
struct TrackInfo {
	int32_t	val_int_curr;	// current value in the internal scale.
	int32_t	val_int_min;	// minimum value in the internal scale.
	int32_t	val_int_max;	// maximum value in the internal scale.
	int32_t	denom;			// ratio between the internal and displayed values; can be 0, which is recognized as 1. always 100 for scripts. (possible values: 0, 1, 10 and 100.)
	int32_t	val_int_def;	// default value in the internal scale.
	HWND	hwnd_track;		// the window handle to the trackbar control.
	HWND	hwnd_label;		// the window handle to the edit control.
	HWND	hwnd_updown;	// the window handle to the updown control.
	int32_t	pos_v;			// vertical position of the group of the trackbar UIs in pixels. 0 if hidden.
	int32_t	delta;			// the smallest distance between possible internal values. can be > 1 only if it's for scripts. (possible values: 1, 10 and 100.)

	// not hidden such as by folding or unassigned to any value in the current object.
	constexpr bool is_visible() const { return pos_v != 0; }
	// calculates the displayed value from an internal value.
	constexpr double calc_value(int val_int) const { return val_int / static_cast<double>(denominator()); }
	// current displayed value.
	constexpr auto value() const { return calc_value(val_int_curr); }
	// minimum displayed value.
	constexpr auto value_min() const { return calc_value(val_int_min); }
	// maximum displayed value.
	constexpr auto value_max() const { return calc_value(val_int_max); }
	// default displayed value.
	constexpr auto value_def() const { return calc_value(val_int_def); }
	// ratio between the internal and displayed values.
	constexpr int denominator() const { return denom != 0 ? denom : 1; }
	// reciprocal of the smallest distance between the displayed values.
	constexpr int precision() const { return denominator() / (delta != 0 ? delta : 1); }

	// all the fields are initialized to zero at startup,
	// and won't contain valid values until they're once used,
	// which is the only case delta is zero.
	constexpr bool has_valid_values() const { return delta != 0; }

	// smallest distance between pos_v's, representing the heights of the group of trackbar UIs.
	constexpr static int TrackHeight = 25;
};
static_assert(sizeof(TrackInfo) == 40);

inline constinit struct ExEdit092 {
	FilterPlugin* fp;
	constexpr static char const* info_exedit092 = "拡張編集(exedit) version 0.92 by ＫＥＮくん";
	bool init(FilterPlugin* this_fp)
	{
		if (fp != nullptr) return true;
		SysInfo si; this_fp->exfunc->get_sys_info(nullptr, &si);
		for (int i = 0; i < si.filter_n; i++) {
			auto that_fp = this_fp->exfunc->get_filterp(i);
			if (that_fp->information != nullptr &&
				0 == std::strcmp(that_fp->information, info_exedit092)) {
				fp = that_fp;
				init_pointers();
				return true;
			}
		}
		return false;
	}

	Object**	ObjectArray_ptr;			// 0x1e0fa4
	int32_t*	SettingDialogObjectIndex;	// 0x177a10
	HWND*		hwnd_setting_dlg;			// 0x1539c8
	//int32_t*	is_playing;					// 0x1a52ec; 0: editing, 1: playing.
	HWND*		hwnd_edit_text;				// 0x236328
	HWND*		hwnd_edit_script;			// 0x230C78
	TrackInfo*	trackinfo_left;				// 0x14d4c8
	TrackInfo*	trackinfo_right;			// 0x14def0
	int32_t*	track_label_is_dragging;	// 0x158d30; 0: idle, 1: dragging.
	int32_t*	track_label_start_drag_x;	// 0x179218
	HWND*		hwnd_track_buttons;			// 0x158f68

	//WNDPROC		setting_dlg_wndproc;		// 0x02cde0

	HWND*		filter_checkboxes;			// 0x14d368
	HWND*		filter_separators;			// 0x1790d8
	uintptr_t*	exdata_table;				// 0x1e0fa8
	char const*	basic_scene_change_names;	// 0x0aef38
	char const*	basic_animation_names;		// 0x0c1f08
	char const* track_script_names;			// 0x0ca010
	char const*	basic_custom_obj_names;		// 0x0ce090
	char const*	basic_camera_eff_names;		// 0x0d20d0
	uint32_t*	easing_specs_builtin;		// 0x0b8390
	uint8_t*	easing_specs_script;		// 0x231d90

	uintptr_t	cmp_shift_state_easing;		// 0x02ca90
	byte*		call_easing_popup_menu;		// 0x02d4b5

	// index: index of the script; zero1, zero2: zero, unknown otherwise.
	void(*load_easing_spec)(int32_t index, int32_t zero1, int32_t zero2); // 0x087940

	Filter**	loaded_filter_table;		// 0x187c98
	//int32_t*	loaded_filter_count;		// 0x146248

private:
	void init_pointers()
	{
		auto pick_addr = [exedit_base=reinterpret_cast<uintptr_t>(fp->dll_hinst)]
			<class T>(T& target, ptrdiff_t offset) { target = std::bit_cast<T>(exedit_base + offset); };
		pick_addr(ObjectArray_ptr,			0x1e0fa4);
		pick_addr(SettingDialogObjectIndex,	0x177a10);
		pick_addr(hwnd_setting_dlg,			0x1539c8);
		//pick_addr(is_playing,				0x1a52ec);
		pick_addr(hwnd_edit_text,			0x236328);
		pick_addr(hwnd_edit_script,			0x230C78);
		pick_addr(trackinfo_left,			0x14d4c8);
		pick_addr(trackinfo_right,			0x14def0);
		pick_addr(track_label_is_dragging,	0x158d30);
		pick_addr(track_label_start_drag_x,	0x179218);
		pick_addr(hwnd_track_buttons,		0x158f68);

		//pick_addr(setting_dlg_wndproc,		0x02cde0);

		pick_addr(filter_checkboxes,		0x14d368);
		pick_addr(filter_separators,		0x1790d8);
		pick_addr(exdata_table,				0x1e0fa8);
